clc;
clear;

disp('Задание №: 7');
disp('Тема: Обработка и сортировка данных в одномерных массивах');
disp('Вариант: 18');
disp('ФИО: ********');
disp('Номер группы: *****');
disp('');
%-----------------------------------------------------------------------

% Входные параметры
a = input('Введите нижнюю границу интервала a: ');
b = input('Введите верхнюю границу интервала b: ');
n = input('Введите длину массива n: ');
z = input('Введите число z: ');
%-----------------------------------------------------------------------

% Генерация случайного массива, равномерно распределенного на [a,b]
rng('shuffle')
arr = a + (b-a) * rand(1, n);

disp('');
disp('Элементы массива:');
for i = 1:n
  fprintf('%d. %.3f\n', i, arr(i));
end
disp('');
%--------------------------------------------




% Создание счетчиков
sum_bolshe = 0;
sum_mense = 0;
sum_05 = 0;

%--------------------------------------------------

% Подсчет количества элементов
for i = 1:n

  % > вещест числа(z)
  if arr(i) > z
    sum_bolshe = sum_bolshe + 1;
  end

  % < вещест числа(z)
  if arr(i) < z
    sum_mense = sum_mense + 1;
  end


  % < 0.5

  drob = abs(arr(i)) - abs(fix(arr(i)));
  if drob < 0.5
    sum_05 = sum_05+1;
    fprintf('элемент суммы %.3f %d\n', arr(i));
  end

end

%------------------------------------------------------------------------------

% Вывод результатов подсчета
disp('');
fprintf('\nКоличество элементов больше %.3f: %d\n', z, sum_bolshe);
fprintf('Количество элементов меньше %.3f: %d\n', z, sum_mense);
fprintf('Количество элементов с дробной частью меньше 0.5: %d\n', sum_05);




clear ans;

